Repository: AgustinSRG/PersonalMediaVault
Catalog: launcher-gui/translations/*/LC_MESSAGES/pmv-gui.po
Languages: es

# AppWindow
source: PersonalMediaVault Launcher
es: Lanzador de PersonalMediaVault

# MainWindow
source: PersonalMediaVault Launcher
es: Lanzador de PersonalMediaVault

# AboutComponent
source: Version
es: Versión

# AboutComponent
source: Visit Website
es: Visitar web

# AboutComponent
source: Visit GitHub
es: Visitar GitHub

# VaultClosedView
source: Welcome to PersonalMediaVault
es: Le damos la bienvenida a PersonalMediaVault

# VaultClosedView
source: Start by opening a vault folder, or opening the default vault folder, located in your user home directory.
es: Comience abriendo una carpeta con un galería, o abriendo la galería por defecto, la cual se encuentra en su carpeta de usuario.

# VaultClosedView
source: Open Vault Folder
es: Abrir carpeta de galería

# VaultClosedView
source: Open Default Vault
es: Abrir galería por defecto

# FatalErrorView
source: Fatal error
es: Error grave

# FatalErrorView
source: A fatal error occurred, forcing the launcher to close
es: Ha ocurrido un error grave, forzando a que el lanzador deba cerrarse

# FatalErrorView
source: Could not find the daemon in any of the expected locations. Please re-install PersonalMediaVault.
es: No se pudo encontrar el binario del servicio en ninguna de las localizaciones esperadas. Por favor, reinstale PersonalMediaVault.

# FatalErrorView
source: Could not find the frontend in any of the expected locations. Please re-install PersonalMediaVault.
es: No se pudo encontrar la interfaz web en ninguna de las localizaciones esperadas. Por favor, reinstale PersonalMediaVault.

# FatalErrorView
source: Could not find FFmpeg in any of the expected locations. Please install FFmpeg in your system.
es: No se pudo encontrar FFmpeg en ninguna de las localizaciones esperadas. Por favor, instale FFmpeg en su sistema.

# FatalErrorView
source: Could not find FFprobe in any of the expected locations. Please install FFmpeg in your system.
es: No se pudo encontrar FFprobe en ninguna de las localizaciones esperadas. Por favor, instale FFmpeg en su sistema.

# FatalErrorView
source: Close Launcher
es: Cerrar lanzador

# OpenErrorView
source: Error opening the vault
es: ERror abriendo la galería

# OpenErrorView
source: An error occurred while trying to open the vault
es: Ha ocurrido un error tratando de abrir la galería

# OpenErrorView
source: Path
es: Ruta

# OpenErrorView
source: Could not create the vault folder.
es: No se pudo crear la carpeta para la galería.

# OpenErrorView
source: Could not lock the vault folder. Maybe there is another process already locking the vault.
es: No se pudo bloquear la carpeta de la galería. Posiblemente otro proceso la está usando en este momento.

# OpenErrorView
source: Could not save the launcher configuration.
es: No se pudo guardar la configuración del lanzador.

# OpenErrorView
source: Back
es: Volver

# OpeningView
source: Opening vault folder
es: Abriendo carpeta de galería

# OpeningView
source: The vault folder is being opened
es: La carpeta de la galería está siendo abierta

# OpeningView
source: Path
es: Ruta

# LockAskView
source: The vault is locked
es: La galería está bloqueada

# LockAskView
source: Opening the vault multiple times can result in data corruption.
es: Abrir la galería múltiples veces puede resultar en corrupción de datos.

# LockAskView
source: We recommend you to go back, unless this is an issue caused by an unexpected shutdown or a crash.
es: Le recomendamos retroceder, a menos que esté seguro de que no hay ningún otro proceso usando la galería.

# LockAskView
source: Path
es: Ruta

# LockAskView
source: Back
es: Volver

# LockAskView
source: Open anyway
es: Abrir de todas formas

# CreateFolderAskView
source: The vault folder does not exist
es: La carpeta de la galería no existe

# CreateFolderAskView
source: Do you want to create it?
es: ¿Desea crearla?

# CreateFolderAskView
source: Path
es: Ruta

# CreateFolderAskView
source: Back
es: Volver

# CreateFolderAskView
source: Create folder
es: Crear carpeta

# InitialConfigView
source: Launcher configuration
es: Configuración del lanzador

# InitialConfigView
source: Configure the daemon to listen on a specific port
es: Configure el servicio para usar un puerto

# InitialConfigView
source: Path
es: Ruta

# InitialConfigView
source: Listening hostname
es: Nombre del host

# InitialConfigView
source: Invalid hostname
es: Nombre del host no válido

# InitialConfigView
source: Listening port
es: Puerto de escucha

# InitialConfigView
source: Invalid port. Must be a number between 1 and 65535
es: Puerto no válido. Debe estar entre 1 y 65535

# InitialConfigView
source: Listen only on localhost (recommended for local vaults)
es: Escuchar solo en local (recomendado para galerías locales)

# InitialConfigView
source: Back
es: Volver

# InitialConfigView
source: Continue
es: Continuar

# CreateVaultView
source: Create vault
es: Crear galería

# CreateVaultView
source: No vault found in the selected path
es: No se ha encontrado ninguna galería en la carpeta seleccionada

# CreateVaultView
source: Path
es: Ruta

# CreateVaultView
source: Input the initial credentials in order to create a new vault
es: Especifique unos credenciales iniciales para la nueva galería

# CreateVaultView
source: Username
es: Usuario

# CreateVaultView
source: Invalid username
es: Usuario no válido

# CreateVaultView
source: Password
es: Contraseña

# CreateVaultView
source: Invalid password
es: Contraseña no válida

# CreateVaultView
source: Password (again)
es: Contraseña (de nuevo)

# CreateVaultView
source: The passwords do not match
es: Las contraseñas no coinciden

# CreateVaultView
source: Back
es: Volver

# CreateVaultView
source: Continue
es: Continuar

# VaultOpenView
source: Path
es: Ruta

# VaultOpenView
source: Status
es: Estado

# VaultOpenView
source: Configuration
es: Configuración

# VaultOpenView
source: Backup
es: Copia de seguridad

# VaultOpenView
source: Other Tools
es: Otras herramientas

# VaultStatusView
source: Vault status
es: Estado de la galería

# VaultStatusView
source: STOPPED
es: PARADA

# VaultStatusView
source: STOPPING
es: PARANDO

# VaultStatusView
source: STARTING
es: INICIANDO

# VaultStatusView
source: RUNNING
es: INICIADA

# VaultStatusView
source: The vault is currently stopped
es: La galería se encuentra parada

# VaultStatusView
source: Stopping the vault...
es: Deteniendo la galería...

# VaultStatusView
source: Starting the vault...
es: Iniciando la galería...

# VaultStatusView
source: The vault is currently running
es: La galería se encuentra en funcionamiento

# VaultStatusView
source: An error occurred trying to start the vault
es: Un error ha ocurrido intentando iniciar la galería

# VaultStatusView
source: Unknown error. Please report this as a bug.
es: Error desconocido. Por favor, reporte esto como un bug.

# VaultStatusView
source: The vault was being locked by another process.
es: La galería está siendo usada por otro proceso.

# VaultStatusView
source: The configured port is in use by another process. Please change it in the configuration.
es: El puerto se escucha se encuentra ocupado. Por favor, cámbielo o en la configuración.

# VaultStatusView
source: Invalid SSL configuration. Please change the configuration.
es: Configuración SSL no válida. Por favor, revise su configuración.

# VaultStatusView
source: Start
es: Iniciar

# VaultStatusView
source: Restart
es: Reiniciar

# VaultStatusView
source: Stop
es: Detener

# VaultStatusView
source: Open browser
es: Abrir navegador

# VaultStatusView
source: Open log file
es: Abrir fichero de log

# VaultConfigView
source: Vault configuration
es: Configuración de la galería

# VaultConfigView
source: Host & Port
es: Host y puerto

# VaultConfigView
source: Other
es: Otros

# VaultConfigHostPortView
source: Listening hostname
es: Nombre del host

# VaultConfigHostPortView
source: Invalid hostname
es: Nombre del host no válido

# VaultConfigHostPortView
source: Listening port
es: Puerto de escucha

# VaultConfigHostPortView
source: Invalid port. Must be a number between 1 and 65535
es: Puerto no válido. Debe estar entre 1 y 65535

# VaultConfigHostPortView
source: Listen only on localhost (recommended for local vaults)
es: Escuchar solo en local (recomendado para galerías locales)

# VaultConfigHostPortView
source: Apply changes
es: Aplicar cambios

# VaultConfigHostPortView
source: Configuration changes successfully saved!
es: ¡Cambios en la configuración guardados!

# VaultConfigOtherView
source: Cache size
es: Tamaño de caché

# VaultConfigOtherView
source: Invalid cache size. Must be a number greater or equal to 0.
es: Tamaño de caché no válido. Debe ser mayor o igual a 0.

# VaultConfigOtherView
source: Log HTTP requests to the vault
es: Registrar peticiones HTTP en los logs

# VaultConfigOtherView
source: Log debug messages (for troubleshooting)
es: Registrar mensajes de depuración en los logs

# VaultConfigOtherView
source: Apply changes
es: Aplicar cambios

# VaultConfigOtherView
source: Configuration changes successfully saved!
es: ¡Cambios en la configuración guardados!

# VaultConfigTlsView
source: Enable TLS / HTTPS for the vault
es: Habilitar TLS / HTTPS para la galería

# VaultConfigTlsView
source: TLS certificate file
es: Fichero de certificado

# VaultConfigTlsView
source: Find
es: Buscar

# VaultConfigTlsView
source: Invalid TLS certificate
es: Certificado TLS no válido

# VaultConfigTlsView
source: TLS private key file
es: Fichero de clave privada

# VaultConfigTlsView
source: Invalid TLS private key
es: Clave privada no válida

# VaultConfigTlsView
source: Apply changes
es: Aplicar cambios

# VaultConfigTlsView
source: Configuration changes successfully saved!
es: ¡Cambios en la configuración guardados!

# VaultConfigFFmpegView
source: FFmpeg binary
es: Binario FFmpeg

# VaultConfigFFmpegView
source: Find
es: Buscar

# VaultConfigFFmpegView
source: Invalid FFmpeg binary path
es: Ruta al binario FFmpeg no válida

# VaultConfigFFmpegView
source: FFprobe binary
es: Binario FFprobe

# VaultConfigFFmpegView
source: Invalid FFprobe binary path
es: Ruta al binario FFprobe no válida

# VaultConfigFFmpegView
source: Video encoder name
es: Nombre del codificador de vídeo

# VaultConfigFFmpegView
source: Invalid video encoder. You can run 'ffmpeg -encoders' in order to check the available ones.
es: Codificador de vídeo no válido. Use 'ffmpeg -encoders' para obtener la lista de codificadores disponibles en su sistema.

# VaultConfigFFmpegView
source: Apply changes
es: Aplicar cambios

# VaultConfigFFmpegView
source: Configuration changes successfully saved!
es: ¡Cambios en la configuración guardados!

# VaultToolsView
source: Vault Tools
es: Herramientas de la galería

# VaultToolsView
source: Select the tool you want to use
es: Elija la herramienta que desea usar

# VaultToolsView
source: Clean inconsistent files
es: Limpiar archivos inconsistentes

# VaultToolsView
source: Recover lost items
es: Recuperar elementos perdidos

# VaultToolsView
source: With this tool you can remove media assets that are not indexed.
es: Con esta herramienta puede limpiar los elementos no indexados.

# VaultToolsView
source: With this tool you can recover media assets that are not indexed.
es: Con esta herramienta puede recuperar los elementos no indexados.

# VaultToolsView
source: Note: The tool requires the vault to be stopped in order to run
es: Nota: Esta herramienta requiere detener la galería mientras se usa

# VaultToolsView
source: Back
es: Volver

# VaultToolsView
source: Start
es: Iniciar

# VaultToolsView
source: Cancel
es: Cancelar

# VaultToolsView
source: Tool successfully used!
es: Herramienta usada con éxito

# VaultToolsView
source: Unknown error
es: Error desconocido

# VaultBackupView
source: Backup
es: Copia de seguridad

# VaultBackupView
source: Select the backup tool you want to use
es: Elija la opción de copia de seguridad que desea usar

# VaultBackupView
source: Create or update backup
es: Crear o actualizar copia de seguridad

# VaultBackupView
source: Export encryption key
es: Exportar clave de encriptación

# VaultBackupView
source: Recover encryption key
es: Recuperar clave de encriptación

# VaultBackupView
source: Make a backup of the vault in order to keep it safe from data loss events.
es: Haga una copia de seguridad de la galería para evitar pérdidas de datos accidentales.

# VaultBackupView
source: Export the vault encryption key to use it in case you lose your password.
es: Exporte la clave de encriptación y guárdela por si pierde sus credenciales de acceso.

# VaultBackupView
source: Did you lose your password? Use the tool to recover access using the encryption key.
es: ¿Ha perdido sus contraseña? Puede usar esta herramienta para recuperar el acceso usando la clave de encriptación.

# VaultBackupView
source: Warning: This will reset all the security options and delete all the extra accounts of the vault.
es: Advertencia: Esto borrará todos los usuarios y reiniciará las opciones de seguridad a sus valores por defecto.

# VaultBackupView
source: Backup path
es: Ruta de la copia

# VaultBackupView
source: Find
es: Buscar

# VaultBackupView
source: Invalid backup path
es: Ruta de la copia de seguridad no válida

# VaultBackupView
source: Main vault username
es: Usuario principal

# VaultBackupView
source: Invalid username
es: Usuario no válido

# VaultBackupView
source: Password
es: Contraseña

# VaultBackupView
source: Invalid password
es: Contraseña no válida

# VaultBackupView
source: Encryption key
es: Clave de encriptación

# VaultBackupView
source: Invalid encryption key.
es: Clave de encriptación no válida.

# VaultBackupView
source: New main username
es: Nuevo usuario principal

# VaultBackupView
source: Password (again)
es: Contraseña (de nuevo)

# VaultBackupView
source: The passwords do not match
es: Las contraseñas no coinciden

# VaultBackupView
source: Back
es: Volver

# VaultBackupView
source: Start
es: Iniciar

# VaultBackupView
source: Cancel
es: Cancelar

# VaultBackupView
source: Finding files
es: Buscando archivos

# VaultBackupView
source: Checking files
es: Comprobando archivos

# VaultBackupView
source: Copying files
es: Copiando archivos

# VaultBackupView
source: Backup completed! Files updated: {}, Bytes copied: {}
es: ¡Copia de seguridad completada! Archivos actualizados: {}. Bytes copiados: {}

# VaultBackupView
source: Encryption key successfully exported!
es: ¡Clave de encriptación exportada con éxito!

# VaultBackupView
source: Encryption key successfully recovered!
es: ¡Clave de encriptación recuperada con éxito!

# VaultBackupView
source: The target folder is locked by another process.
es: La carpeta de destino está bloqueada por otro proceso.

# VaultBackupView
source: The target folder is the same as the source folder.
es: La carpeta de destino es la misma que la de origen.

# VaultBackupView
source: The vault does not have any encrypted files yet.
es: La galería no tiene ningún archivo encriptado todavía.

# VaultBackupView
source: Unknown error
es: Error desconocido

# VaultBackupView
source: Copy
es: Copiar

# AboutComponent
source: Preferences
es: Preferencias

# UserSettingsPopupWindow
source: Preferences
es: Preferencias

# UserSettingsPopupWindow
source: Language
es: Idioma

# UserSettingsPopupWindow
source: System language (default)
es: Idioma del sistema (por defecto)

# UserSettingsPopupWindow
source: Color theme
es: Tema de color

# UserSettingsPopupWindow
source: System theme (default)
es: Tema del sistema (por defecto)

# UserSettingsPopupWindow
source: Dark theme
es: Tema oscuro

# UserSettingsPopupWindow
source: Light theme
es: Tema claro

# UserSettingsPopupWindow
source: Done
es: Listo

# UserSettingsPopupWindow
source: Note: if you change the language, you must restart the launcher to make the changes effective
es: Nota: Si cambia el idioma, deberá reiniciar el lanzador para que los cambios surtan efecto
